### Intro
This is a Python notebook to explain and try out more advanced Python SQL interactions

In [ ]:
#1. commands beginning with '%' are sent to the terminal (Cool!)
#2. ipython-sql allows you to specify sql commands in-line (not as strings) by using '%' or '%%' (see below)
%pip install ipython-sql

In [1]:
#The percent operator allows you to load extensions to make the Python shell interpret commands differently.
#More info: https://ipython.readthedocs.io/en/stable/config/extensions/index.html
%load_ext sql

In [2]:
# Note: port 5432 is the default used by postgres

db_host = '127.0.0.1'
db = 'pagila'
db_user = 'basic_user'
db_password = 'password'
db_port = '5432'

connection = f'postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db}'
print(connection)

postgresql://basic_user:password@127.0.0.1:5432/pagila

In [3]:
#Connecting to Database
%sql $connection

In [114]:
'''
Notes on '%' operator when using sql commands:
1. Each command preceded by '%' will be interpreted by the terminal
2. You can use '$' to insert Python variables into these single-line commands
3. You can also write multi-line commands with '%%', but these do not support inserting Python variables with '$'
'''
%sql SELECT * FROM store;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 9, 57, 12)),
 (2, 2, 2, datetime.datetime(2006, 2, 15, 9, 57, 12))]

In [ ]:
# Showing an overview of how much data we have:

#%sql SELECT * FROM information_schema.tables WHERE table_schema = 'public';
tables = ['film','store','customer','rental','payment','staff','city','country']
for tbl in tables:
    data = %sql SELECT COUNT(*) FROM $tbl;
    print(f'{tbl}\t' + str(data[0][0]))

In [ ]:
#Get range of all payment dates:
%%sql
SELECT min(payment_date) as start, max(payment_date) as end from payment;

#### See all districts where customers are living

In [ ]:
%%sql
SELECT district, SUM(city_id) as count
FROM address
GROUP BY district
ORDER BY count DESC
LIMIT 20;

#### What are the top-grossing movies in this database?
So what are the movies which, in aggregate, have earned the most money?

In [ ]:
%%sql
SELECT SUM(payment.amount) as income, film.film_id, film.title
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY film.film_id, film.title
ORDER BY income DESC
LIMIT 20;

#### What are the cities whose customers provide the most income in this database?
So what are the cities where customers live which, when aggregated, have paid the most?

In [ ]:
%%sql
SELECT SUM(payment.amount) as income, city.city_id, city.city
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city on address.city_id = city.city_id
GROUP BY city.city_id, city.city
ORDER BY income DESC
LIMIT 10;

#### Revenue of Movie by Customer City and by Month

In [ ]:
%%sql
SELECT film.title, 
    SUM(payment.amount) AS income,
    city.city,
    EXTRACT(month FROM payment.payment_date) as month
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city on address.city_id = city.city_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY city.city, month, film.title
ORDER BY month, income DESC
LIMIT 10;

### Changing Pagila to Fact + Dimension Tables
In order to make the queries above easier to write (and to have them run faster) we will transform the Pagila database to be fact + dimension tables.
The fact + dimension tables have already been designed (see image below), but let's talk about the logic behind this redesign.

![image](media/3nf_to_star.png)

1. The primary 'interaction' that we are interested in is **sales**. All of our queries are basically revolving around how to break down sales in different ways. Therefore, it makes sense for us to focus on 'sales' as our main fact table, and have dimension tables support the various ways we want to analyse these data further.
2. When it comes to the 'sales' fact table, we need to represent (a) relationships between sales and dimension tables and (b) any attributes of sales which don't make sense to store in a separate dimension table (i.e., sales amount).

Let's get started on making this change from the 3NF form to the star schema.

## Creating Star Schema
#### DIMENSION - date table
The date table doesn't actually exist in the 3NF table, but we can derive it quite easily

##### Creating dimdate Table:

In [ ]:
%%sql
CREATE TABLE dimdate (
    date_key integer NOT NULL PRIMARY KEY,
    date DATE NOT NULL,
    year SMALLINT CHECK (year BETWEEN 1900 AND 3000) NOT NULL,
    quarter SMALLINT CHECK (quarter BETWEEN 1 AND 4) NOT NULL,
    month SMALLINT CHECK (month BETWEEN 1 AND 12) NOT NULL,
    day SMALLINT CHECK (day BETWEEN 1 AND 31) NOT NULL,
    week SMALLINT CHECK (week BETWEEN 1 AND 54) NOT NULL,
    is_weekend BOOLEAN NOT NULL
)

##### Populating dimdate Table from 'Payment_Date'
Notes: I guess the best way to pull data from 1 table and use it to populate another is to use Python.

Plan:
1. Can I iterate over results of Postgres query, transform data as needed, and then INSERT into new table?
2. If I do this, I'm not sure it really makes sense to use %sql syntax - If I use psycopg2, I can query Postgres more programmatically and iterate over the results more easily.

Update:
It looks like there's actually a way to do this purely within Postgres queries! It's essentially wrapping a 'select' statement with an 'insert' statement See below...

In [ ]:
%%sql
INSERT INTO dimdate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT
    DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD') ::INTEGER) as date_key,
    DATE(payment_date) AS date,
    EXTRACT(year FROM payment_date) AS year,
    EXTRACT(quarter FROM payment_date) AS quarter,
    EXTRACT(month FROM payment_date) AS month,
    EXTRACT(day FROM payment_date) AS day,
    EXTRACT(week FROM payment_date) AS week,
    CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6,7) THEN true ELSE false END AS is_weekend
FROM payment;

#### DIMENSION - customer table
Note: Below I am creating some parameters for how 'email' must be defined. There is some debate on the interwebs as to how to best do this, but to keep things simple, I am only requiring:
- the '@' character
- a dot character to indicate at least 1 domain
- some limits on the number of characters (See discussion here: https://stackoverflow.com/questions/386294/what-is-the-maximum-length-of-a-valid-email-address)

In [3]:
%%sql
CREATE EXTENSION citext;
CREATE DOMAIN email AS citext
    CHECK (value ~ '.{1,64}?@.*?\.org')

UsageError: Cell magic `%%sql` not found.

##### Creating Customer Table:

In [ ]:
%%sql
CREATE TABLE dimcustomer (
    customer_key SERIAL NOT NULL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    first_name VARCHAR,
    last_name VARCHAR,
    email EMAIL UNIQUE NOT NULL,
    address VARCHAR,
    address2 VARCHAR,
    district VARCHAR,
    city VARCHAR,
    country VARCHAR,
    postal_code VARCHAR,
    phone VARCHAR,
    active BOOLEAN NOT NULL,
    create_date DATE NOT NULL,
    start_date DATE,
    end_date DATE
)

##### Populating dimcustomer Table:

In [ ]:
%%sql
INSERT INTO dimcustomer (customer_id, first_name, last_name, email, address, address2,
district, city, country, postal_code, phone, active, create_date, start_date, end_date)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    a.address,
    a.address2,
    a.district,
    city.city,
    country.country,
    a.postal_code,
    a.phone,
    CAST(c.active AS BOOLEAN),
    c.create_date,
    now() AS start_date,
    now() AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city       ON (a.city_id = city.city_id)
JOIN country    ON (city.country_id = country.country_id);

#### DIMENSION - movie table

In [ ]:
%%sql
CREATE TABLE dimmovie (
    movie_key SERIAL NOT NULL PRIMARY KEY,
    film_id INTEGER NOT NULL,
    title VARCHAR NOT NULL,
    description VARCHAR NOT NULL,
    release_year SMALLINT CHECK (release_year BETWEEN 1000 AND 3000) NOT NULL,
    language VARCHAR NOT NULL,
    original_language VARCHAR,
    rental_duration SMALLINT NOT NULL,
    length REAL NOT NULL,
    rating VARCHAR,
    special_features VARCHAR NOT NULL
)

##### Populating dimcustomer Table:

In [ ]:
%%sql
INSERT INTO dimmovie (film_id, title, description, release_year,
language, original_language, rental_duration, length, rating, special_features)
SELECT
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name AS language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l         ON (f.language_id = l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

#### DIMENSION - store table

In [ ]:
%%sql
CREATE TABLE dimstore (
    store_key SERIAL NOT NULL PRIMARY KEY,
    store_id INTEGER NOT NULL,
    address VARCHAR NOT NULL,
    address2 VARCHAR,
    district VARCHAR,
    city VARCHAR NOT NULL,
    country VARCHAR NOT NULL,
    postal_code VARCHAR NOT NULL,
    manager_first_name VARCHAR,
    manager_last_name VARCHAR,
    start_date DATE,
    end_date DATE
)

##### Populating dimstore Table:

In [ ]:
%%sql
INSERT INTO dimstore (store_id, address, address2, district, city, country, postal_code,
manager_first_name, manager_last_name, start_date, end_date)
SELECT
    s.store_id,
    a.address,
    a.address2,
    a.district,
    c.city,
    country.country,
    a.postal_code,
    staff.first_name AS manager_first_name,
    staff.last_name AS manager_last_name,
    now() AS start_date,
    now() AS end_date
FROM store s
JOIN address a  ON (s.address_id = a.address_id)
JOIN city c     ON (a.city_id = c.city_id)
JOIN country    ON (c.country_id = country.country_id)
JOIN staff      ON (s.manager_staff_id = staff.staff_id);

#### FACT - factsales table

In [115]:
%%sql
CREATE TABLE factsales (
    sales_key       SERIAL PRIMARY KEY,
    date_key        INT NOT NULL REFERENCES dimdate(date_key),
    customer_key    INT NOT NULL REFERENCES dimcustomer(customer_key),
    movie_key       INT NOT NULL REFERENCES dimmovie(movie_key),
    store_key       INT NOT NULL REFERENCES dimstore(store_key),
    sales_amount    DECIMAL(5,2) NOT NULL
)

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
Done.

[]

##### Populating factsales Table:

In [119]:
%%sql
INSERT INTO factsales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT
    TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::INTEGER AS date_key,
    p.customer_id AS customer_key,
    i.film_id AS movie_key,
    i.store_id AS store_key,
    p.amount AS sales_amount
FROM payment p
JOIN rental r       ON (p.rental_id = r.rental_id)
JOIN inventory i    ON (r.inventory_id = i.inventory_id);

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
32098 rows affected.

[]

## Querying Data

In [10]:
%%time
%%sql
SELECT dimmovie.title, dimdate.month, dimcustomer.city, factsales.sales_amount FROM factsales
JOIN dimmovie ON factsales.movie_key = dimmovie.movie_key
JOIN dimcustomer ON factsales.customer_key = dimcustomer.customer_key
JOIN dimdate ON factsales.date_key = dimdate.date_key
LIMIT 10;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 6.51 ms, sys: 1.62 ms, total: 8.13 ms
Wall time: 7.44 ms

[('SWARM GOLD', 1, 'Salinas', Decimal('1.99')),
 ('PACKER MADIGAN', 1, 'Salinas', Decimal('0.99')),
 ('SOMETHING DUCK', 1, 'Salinas', Decimal('6.99')),
 ('DRACULA CRYSTAL', 1, 'Salinas', Decimal('0.99')),
 ('CLONES PINOCCHIO', 1, 'Salinas', Decimal('4.99')),
 ('DALMATIONS SWEDEN', 1, 'Salinas', Decimal('2.99')),
 ('STRAIGHT HOURS', 1, 'Kalisz', Decimal('1.99')),
 ('MARRIED GO', 1, 'Kalisz', Decimal('4.99')),
 ('DIVORCE SHINING', 1, 'Kumbakonam', Decimal('8.99')),
 ('GOLDMINE TYCOON', 1, 'Yantai', Decimal('0.99'))]

## Speed Comparison: 3NF vs. Star Schema
The start schema table query runs in 50-85 ms.
The 3NF table query runs in 120 - 180 ms.

This difference will only grow with the size of the tables; the conclusion being that de-normalizing data is a way to better scale analytics (at the cost of ACID and storage space).

In [31]:
%%time
%%sql
SELECT m.title, SUM(sales_amount) AS amount, c.city, d.month
FROM factsales
JOIN dimmovie m ON factsales.movie_key = m.movie_key
JOIN dimcustomer c ON factsales.customer_key = c.customer_key
JOIN dimdate d ON factsales.date_key = d.date_key
GROUP BY m.title, c.city, d.month
LIMIT 10;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 5.9 ms, sys: 843 µs, total: 6.75 ms
Wall time: 49.5 ms

[('ACADEMY DINOSAUR', Decimal('3.98'), 'Almirante Brown', 3),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Celaya', 1),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Charlotte Amalie', 4),
 ('ACADEMY DINOSAUR', Decimal('3.98'), 'Cianjur', 1),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Goinia', 3),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Hamilton', 4),
 ('ACADEMY DINOSAUR', Decimal('3.98'), 'Jos Azueta', 4),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Kaliningrad', 3),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Kurashiki', 3),
 ('ACADEMY DINOSAUR', Decimal('1.98'), 'Lipetsk', 4)]

In [39]:
%%time
%%sql
SELECT film.title, 
    SUM(payment.amount) AS income,
    city.city,
    EXTRACT(month FROM payment.payment_date) as month
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city on address.city_id = city.city_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY city.city, month, film.title
ORDER BY month, income DESC
LIMIT 10;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 9.09 ms, sys: 1.63 ms, total: 10.7 ms
Wall time: 177 ms

[('SHOW LORD', Decimal('23.98'), 'Mannheim', Decimal('1')),
 ('AMERICAN CIRCUS', Decimal('21.98'), 'Callao', Decimal('1')),
 ('KISSING DOLLS', Decimal('21.98'), 'Toulon', Decimal('1')),
 ('CASUALTIES ENCINO', Decimal('21.98'), 'Warren', Decimal('1')),
 ('TELEGRAPH VOYAGE', Decimal('21.98'), 'Naala-Porto', Decimal('1')),
 ('MOONSHINE CABIN', Decimal('19.98'), 'Balaiha', Decimal('1')),
 ('MILLION ACE', Decimal('19.98'), 'Bergamo', Decimal('1')),
 ('DARKO DORADO', Decimal('19.98'), 'Bhilwara', Decimal('1')),
 ('MINE TITANS', Decimal('19.98'), 'Bradford', Decimal('1')),
 ('AUTUMN CROW', Decimal('19.98'), 'Ashgabat', Decimal('1'))]

## Creating OLAP Cubes
- The results of the cube is a long table showing all possible combinations of dimensions specified in 'GROUP BY' clause and the output you specified (in this case, sum of sales)
- 'Slicing' or 'Dicing' the cube is as easy as including 'WHERE' clauses in the query- so that only certain values of certain dimensions are included in the cube
- 'Drilling Down' or 'Rolling up' require aggregating or disaggregating the data. This relationship (e.g., that 'day' belongs to 'month' belongs to 'year) is not explicitly specified, so I think we just need to re-do the query with using the aggregated or disaggregated attribute instead.

Note:
Let's say that you want to see results grouped by Month, Movie Rating, and City, but it's not actually important to you how 'Movie Rating' relates to 'Month' when 'City' is held constant. Instead of writing `GROUP BY (month, rating, city)` you could create **grouping sets** to more specifically say the cross-tabs that you want:
`GROUP BY GROUPING SETS ((), month, rating, city,(rating, city))`

Note: When you see "**None**" in results below, it actually means 'including all values in this attribute'. It's a good practice to **drop all null or empty values from your data set before doing a cube** to ensure that no real values could be confused with "None"

In [38]:
%%time
%%sql
SELECT SUM(sales_amount) AS amount, c.country, d.month, m.rating
FROM factsales
JOIN dimmovie m ON factsales.movie_key = m.movie_key
JOIN dimcustomer c ON factsales.customer_key = c.customer_key
JOIN dimdate d ON factsales.date_key = d.date_key
GROUP BY GROUPING SETS ((), c.country, d.month,(c.country, m.rating))
ORDER BY c.country DESC, m.rating DESC
LIMIT 20;

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 5.89 ms, sys: 797 µs, total: 6.69 ms
Wall time: 43.6 ms

[(Decimal('19263.76'), None, 2, None),
 (Decimal('9648.86'), None, 1, None),
 (Decimal('134833.02'), None, None, None),
 (Decimal('57118.92'), None, 4, None),
 (Decimal('47773.12'), None, 3, None),
 (Decimal('1028.36'), None, 5, None),
 (Decimal('269.34'), 'Zambia', None, None),
 (Decimal('85.80'), 'Zambia', None, 'R'),
 (Decimal('29.94'), 'Zambia', None, 'PG-13'),
 (Decimal('67.80'), 'Zambia', None, 'PG'),
 (Decimal('39.92'), 'Zambia', None, 'NC-17'),
 (Decimal('45.88'), 'Zambia', None, 'G'),
 (Decimal('518.86'), 'Yugoslavia', None, None),
 (Decimal('131.72'), 'Yugoslavia', None, 'R'),
 (Decimal('173.62'), 'Yugoslavia', None, 'PG-13'),
 (Decimal('73.82'), 'Yugoslavia', None, 'PG'),
 (Decimal('57.86'), 'Yugoslavia', None, 'NC-17'),
 (Decimal('81.84'), 'Yugoslavia', None, 'G'),
 (Decimal('1021.66'), 'Yemen', None, None),
 (Decimal('175.54'), 'Yemen', None, 'R')]

#### Using 'CUBE' syntax
The 'CUBE' syntax is the same as *including every possible combination in 'GROUPING SETS'*
To review, the code below shows 3 different ways of grouping and what their results will be
```
SELECT SUM(sales_amount) AS amount, c.country, d.month, m.rating
FROM factsales
JOIN dimmovie m ON factsales.movie_key = m.movie_key
JOIN dimcustomer c ON factsales.customer_key = c.customer_key
JOIN dimdate d ON factsales.date_key = d.date_key
WHERE d.month = 5

-- This will only calculate one single crosstab - the overlap between all attributes (overlaps between only 2 attributes, or no groupings at all are not shown)
GROUP BY (c.country, d.month, m.rating)

-- This allows you to calculate crosstabs BETWEEN ONLY SPECIFIC ATTRIBUTES
GROUP BY GROUPING SETS ((), c.country, d.month,(c.country, m.rating));

-- This calculates crosstabs between ALL POSSIBLE ATTRIBUTE COMBINATIONS
GROUP BY CUBE(c.country, d.month, m.rating)
```

In [32]:
%sql select DISTINCT d.month FROM dimdate d

 * postgresql://basic_user:***@127.0.0.1:5432/pagila
5 rows affected.

[(3,), (5,), (4,), (2,), (1,)]